99percentpeople/esp32qjs/components/esp32_mquickjs/src/modules/wifi_dpp/esp32_mquickjs_wifi_dpp_session.c
#include "esp32_mquickjs_wifi_dpp_session.h"
#include "esp32_mquickjs_memory.h"
#if CONFIG_ESP32_MQUICKJS_FEATURE_WIFI && CONFIG_ESP_WIFI_DPP_SUPPORT && CONFIG_ESP_NETIF_USES_TCPIP_WITH_BSD_API && CONFIG_LWIP_IPV4
#include "esp32_mquickjs_core.h"
#include "esp32_mquickjs_future.h"
#include "esp32_mquickjs_wireless_core.h"
#include "esp32_mquickjs_wifi.h"
#include "esp_heap_caps.h"
#include "esp_timer.h"
#include "freertos/FreeRTOS.h"
#include <string.h>

struct esp32_mquickjs_wifi_dpp_session {
    uint32_t references, timeout_ms, station_identity;
    uint32_t receive_waiters, close_waiters;
    esp32_mquickjs_wifi_dpp_session_status_t status;
    esp32_mquickjs_wifi_radio_lease_t owners[3];
    esp32_mquickjs_wifi_radio_operation_t operation;
    esp32_mquickjs_wifi_dpp_worker_options_t options;
    wifi_config_t connection_config;
    esp32_mquickjs_wifi_link_snapshot_t connection_link;
    uint32_t connection_generation;
    int64_t connection_started_us, connection_completed_us;
    esp_dpp_config_data_t configs[ESP_DPP_MAX_CONFIG_COUNT];
    char uri[ESP32QJS_DPP_URI_MAX + 1U];
    int64_t deadline_us, next_retry_us;
    bool worker_started, allow_ap_channel_change, allow_ap_restart;
    bool restore_recovery_requested;
};
static portMUX_TYPE s_dpp_session_lock = portMUX_INITIALIZER_UNLOCKED;
static esp32_mquickjs_wifi_dpp_session_t *s_dpp_active;
static unsigned s_dpp_handles, s_dpp_workers;
static bool s_dpp_runtime_closing = true;

static void dpp_session_scrub(esp32_mquickjs_wifi_dpp_session_t *s)
{
    esp32_mquickjs_wireless_secure_zero(&s->options, sizeof(s->options));
    esp32_mquickjs_wireless_secure_zero(s->uri, sizeof(s->uri));
    esp32_mquickjs_wireless_secure_zero(&s->configs, sizeof(s->configs));
    esp32_mquickjs_wireless_secure_zero(&s->connection_config, sizeof(s->connection_config));
    s->status.uri_ready = s->status.configs_ready = false;
}

static void dpp_session_close_locked(esp32_mquickjs_wifi_dpp_session_t *s, bool timeout)
{
    if (!s->status.closing && timeout) {
        s->status.timed_out = true;
        if (s->status.error == ESP_OK) { s->status.error = ESP_ERR_TIMEOUT; s->status.stage = "dpp-timeout"; }
    }
    s->status.closing = true;
    s->status.connected = false;
    s->next_retry_us = 0;
    if (!s->status.worker_busy) dpp_session_scrub(s);
    if (!s->status.activated) s->status.retired = true;
}

esp_err_t esp32_mquickjs_wifi_dpp_open_runtime(void)
{
    portENTER_CRITICAL(&s_dpp_session_lock);
    bool ready = !s_dpp_active && !s_dpp_workers && !s_dpp_handles;
    if (ready) s_dpp_runtime_closing = false;
    portEXIT_CRITICAL(&s_dpp_session_lock);
    return ready ? ESP_OK : ESP_ERR_INVALID_STATE;
}

esp_err_t esp32_mquickjs_wifi_dpp_session_create(const esp32_mquickjs_wifi_dpp_worker_options_t *options,
    bool allow_ap_channel_change, uint32_t timeout_ms, esp32_mquickjs_wifi_dpp_session_t **out)
{
    if (!out || *out || !timeout_ms || timeout_ms > 3600000)
        return ESP_ERR_INVALID_ARG;
    esp_err_t error = esp32_mquickjs_wifi_dpp_worker_validate(options);
    if (error != ESP_OK) return error;
    portENTER_CRITICAL(&s_dpp_session_lock);
    error = s_dpp_runtime_closing ? ESP_ERR_INVALID_STATE :
        s_dpp_handles >= ESP32_MQUICKJS_DPP_MAX_HANDLES ? ESP_ERR_NO_MEM : ESP_OK;
    if (error == ESP_OK) ++s_dpp_handles;
    portEXIT_CRITICAL(&s_dpp_session_lock);
    if (error != ESP_OK) return error;
    esp32_mquickjs_wifi_dpp_session_t *s = esp32_mquickjs_memory_wireless_calloc("wifi", 1, sizeof(*s), ESP32_MQUICKJS_MEMORY_DEFAULT, ESP32_MQUICKJS_MEMORY_BUDGET_CONTROL);
    if (!s) {
        portENTER_CRITICAL(&s_dpp_session_lock); --s_dpp_handles; portEXIT_CRITICAL(&s_dpp_session_lock);
        return ESP_ERR_NO_MEM;
    }
    s->references = 1; s->timeout_ms = timeout_ms; s->options = *options;
    s->allow_ap_channel_change = allow_ap_channel_change;
    s->status.reserved_bytes = sizeof(*s);
    *out = s;
    return ESP_OK;
}

bool esp32_mquickjs_wifi_dpp_session_retain(esp32_mquickjs_wifi_dpp_session_t *s)
{
    if (!s) return false;
    portENTER_CRITICAL(&s_dpp_session_lock);
    bool ok = s->references && s->references != UINT32_MAX;
    if (ok) ++s->references;
    portEXIT_CRITICAL(&s_dpp_session_lock);
    return ok;
}

void esp32_mquickjs_wifi_dpp_session_release(esp32_mquickjs_wifi_dpp_session_t *s)
{
    if (!s) return;
    portENTER_CRITICAL(&s_dpp_session_lock);
    bool destroy = --s->references == 0;
    if (s->references == 1 && s_dpp_active == s) dpp_session_close_locked(s, false);
    portEXIT_CRITICAL(&s_dpp_session_lock);
    if (!destroy) return;
    esp32_mquickjs_wireless_secure_zero(s, sizeof(*s));
    esp32_mquickjs_memory_payload_free(s);
    portENTER_CRITICAL(&s_dpp_session_lock); --s_dpp_handles; portEXIT_CRITICAL(&s_dpp_session_lock);
}

esp_err_t esp32_mquickjs_wifi_dpp_session_activate(esp32_mquickjs_wifi_dpp_session_t *s)
{
    if (!s) return ESP_ERR_INVALID_ARG;
    int64_t now = esp_timer_get_time(), duration = (int64_t)s->timeout_ms * 1000;
    if (now < 0 || now > INT64_MAX - duration) return ESP_ERR_INVALID_STATE;
    portENTER_CRITICAL(&s_dpp_session_lock);
    bool ready = !s_dpp_runtime_closing && !s_dpp_active && !s->status.activated &&
        !s->status.closing && s->references != UINT32_MAX;
    if (ready) {
        ++s->references; s_dpp_active = s;
        s->status.activated = true; s->deadline_us = now + duration;
    }
    portEXIT_CRITICAL(&s_dpp_session_lock);
    if (!ready) return ESP_ERR_INVALID_STATE;
    esp_err_t error = esp32_mquickjs_wifi_dpp_station_reserve(&s->station_identity, s->owners);
    if (error != ESP_OK) {
        portENTER_CRITICAL(&s_dpp_session_lock);
        s->status.error = error; s->status.stage = "dpp-station-reserve";
        dpp_session_close_locked(s, false); s->status.retired = true;
        s_dpp_active = NULL;
        portEXIT_CRITICAL(&s_dpp_session_lock);
        esp32_mquickjs_wifi_dpp_session_release(s); /* Registry, no native admission. */
    }
    return error;
}

void esp32_mquickjs_wifi_dpp_session_close(esp32_mquickjs_wifi_dpp_session_t *s, bool timeout)
{
    if (!s) return;
    portENTER_CRITICAL(&s_dpp_session_lock); dpp_session_close_locked(s, timeout); portEXIT_CRITICAL(&s_dpp_session_lock);
}

esp_err_t esp32_mquickjs_wifi_dpp_session_recover(esp32_mquickjs_wifi_dpp_session_t *s)
{
    if (!s) return ESP_ERR_INVALID_ARG;
    portENTER_CRITICAL(&s_dpp_session_lock);
    esp_err_t error = ESP_ERR_INVALID_STATE;
    if (s_dpp_active == s && !s_dpp_runtime_closing && s->status.closing &&
        !s->status.retired && !s->status.native_closed && !s->connection_generation && s->operation.identity) {
        if (s->status.recovery_pending) error = ESP_OK;
        else if (s->status.native.restore_start_failed && !s->status.native.worker.handoff_unknown) {
            s->restore_recovery_requested = s->status.recovery_pending = true;
            s->next_retry_us = 0;
            error = ESP_OK;
        }
    }
    portEXIT_CRITICAL(&s_dpp_session_lock);
    return error;
}

bool esp32_mquickjs_wifi_dpp_session_status(esp32_mquickjs_wifi_dpp_session_t *s,
    esp32_mquickjs_wifi_dpp_session_status_t *status)
{
    if (!s || !status) return false;
    portENTER_CRITICAL(&s_dpp_session_lock); *status = s->status; portEXIT_CRITICAL(&s_dpp_session_lock);
    return true;
}

