99percentpeople/esp32qjs/components/esp32_mquickjs/src/modules/wifi_dpp/esp32_mquickjs_wifi_dpp_session.c
void esp32_mquickjs_wifi_dpp_global_status(esp32_mquickjs_wifi_dpp_global_status_t *status)
{
    if (!status) return;
    portENTER_CRITICAL(&s_dpp_session_lock);
    *status = (esp32_mquickjs_wifi_dpp_global_status_t){.handles = s_dpp_handles, .workers = s_dpp_workers,
        .active = s_dpp_active != NULL, .runtime_closing = s_dpp_runtime_closing};
    if (s_dpp_active) status->session = s_dpp_active->status;
    portEXIT_CRITICAL(&s_dpp_session_lock);
}

esp_err_t esp32_mquickjs_wifi_dpp_session_uri(esp32_mquickjs_wifi_dpp_session_t *s,
    char *uri, size_t capacity, bool commit)
{
    if (!s || (!commit && (!uri || !capacity)) || (commit && (uri || capacity))) return ESP_ERR_INVALID_ARG;
    portENTER_CRITICAL(&s_dpp_session_lock);
    esp_err_t error = s->status.closing ? ESP_ERR_INVALID_STATE :
        s->status.worker_busy || !s->status.uri_ready || s->status.uri_consumed ? ESP_ERR_NOT_FINISHED : ESP_OK;
    if (error == ESP_OK) {
        if (commit) {
            esp32_mquickjs_wireless_secure_zero(s->uri, sizeof(s->uri));
            s->status.uri_consumed = true; s->status.uri_ready = false;
        } else if (capacity <= s->status.uri_length) error = ESP_ERR_INVALID_SIZE;
        else memcpy(uri, s->uri, s->status.uri_length + 1U);
    }
    portEXIT_CRITICAL(&s_dpp_session_lock);
    return error;
}

esp_err_t esp32_mquickjs_wifi_dpp_session_config(esp32_mquickjs_wifi_dpp_session_t *s,
    unsigned index, esp_dpp_config_data_t *config)
{
    if (!s || !config) return ESP_ERR_INVALID_ARG;
    portENTER_CRITICAL(&s_dpp_session_lock);
    esp_err_t error = s->status.closing ? ESP_ERR_INVALID_STATE :
        s->status.worker_busy || (!s->status.configs_ready && !s->status.configs_consumed) ? ESP_ERR_NOT_FINISHED :
        index >= s->status.config_count ? ESP_ERR_INVALID_ARG : ESP_OK;
    if (error == ESP_OK) *config = s->configs[index];
    portEXIT_CRITICAL(&s_dpp_session_lock);
    return error;
}

esp_err_t esp32_mquickjs_wifi_dpp_session_configs_commit(esp32_mquickjs_wifi_dpp_session_t *s)
{
    if (!s) return ESP_ERR_INVALID_ARG;
    portENTER_CRITICAL(&s_dpp_session_lock);
    esp_err_t error = s->status.closing ? ESP_ERR_INVALID_STATE :
        s->status.worker_busy || !s->status.configs_ready ? ESP_ERR_NOT_FINISHED : ESP_OK;
    if (error == ESP_OK) { s->status.configs_ready = false; s->status.configs_consumed = true; }
    portEXIT_CRITICAL(&s_dpp_session_lock);
    return error;
}

esp_err_t esp32_mquickjs_wifi_dpp_session_connect(esp32_mquickjs_wifi_dpp_session_t *s,
    unsigned index, esp32_mquickjs_wifi_dpp_auth_t authentication, uint32_t timeout_ms, bool allow_ap_restart)
{
    if (!s || !timeout_ms || timeout_ms > 3600000) return ESP_ERR_INVALID_ARG;
    int64_t now = esp_timer_get_time(), duration = (int64_t)timeout_ms * 1000;
    if (now < 0 || now > INT64_MAX - duration) return ESP_ERR_INVALID_STATE;
    wifi_config_t prepared;
    esp32_mquickjs_wifi_dpp_auth_t selected;
    portENTER_CRITICAL(&s_dpp_session_lock);
    esp_err_t error = s_dpp_runtime_closing || s != s_dpp_active || s->status.closing ||
        (s->status.worker_busy && !s->status.connected) || !s->status.configs_consumed ||
        (s->status.connection_requested && !s->status.connected) ? ESP_ERR_INVALID_STATE :
        index >= s->status.config_count ? ESP_ERR_INVALID_ARG : ESP_OK;
    /* Pure bounded validation under the storage lock; no allocation/driver or
     * JS call. The worker prepares another copy before its first mutation. */
    if (error == ESP_OK) error = esp32_mquickjs_wifi_dpp_connection_prepare(&s->configs[index], authentication, &selected, &prepared);
    if (error == ESP_OK && s->status.connection_requested &&
        (index != s->status.configuration_index || selected != s->status.authentication)) error = ESP_ERR_INVALID_STATE;
    if (error == ESP_OK && !s->status.connection_requested) {
        s->status.configuration_index = index; s->status.authentication = selected;
        s->status.connection_requested = true;
        s->allow_ap_restart = allow_ap_restart;
        s->connection_started_us = now; s->deadline_us = now + duration; s->next_retry_us = 0;
    }
    portEXIT_CRITICAL(&s_dpp_session_lock);
    esp32_mquickjs_wireless_secure_zero(&prepared, sizeof(prepared));
    return error;
}

esp_err_t esp32_mquickjs_wifi_dpp_session_connection_result(esp32_mquickjs_wifi_dpp_session_t *s,
    esp32_mquickjs_wifi_link_snapshot_t *link, double *elapsed_ms)
{
    if (!s || !link || !elapsed_ms) return ESP_ERR_INVALID_ARG;
    portENTER_CRITICAL(&s_dpp_session_lock);
    esp_err_t error = s->status.closing || !s->status.connected || !s->status.connection_verified ? ESP_ERR_INVALID_STATE : ESP_OK;
    esp32_mquickjs_wifi_radio_operation_t token = s->operation;
    uint32_t generation = s->connection_generation;
    if (error == ESP_OK) {
        *link = s->connection_link;
        *elapsed_ms = (double)(s->connection_completed_us - s->connection_started_us) / 1000.0;
    }
    portEXIT_CRITICAL(&s_dpp_session_lock);
    if (error != ESP_OK) return error;
    esp32_mquickjs_wifi_dpp_connection_status_t current;
    error = esp32_mquickjs_wifi_dpp_connect_status(&token, generation, &current);
    if (error == ESP_OK && (!current.connected || current.draining || !current.link.valid ||
        memcmp(current.link.bssid, link->bssid, sizeof(link->bssid)) || current.link.channel != link->channel))
        error = ESP_ERR_INVALID_STATE;
    return error;
}

bool esp32_mquickjs_wifi_dpp_session_wait_begin(esp32_mquickjs_wifi_dpp_session_t *s, bool close)
{
    portENTER_CRITICAL(&s_dpp_session_lock);
    uint32_t *count = close ? &s->close_waiters : &s->receive_waiters;
    bool ready = *count != UINT32_MAX;
    if (ready) ++*count;
    portEXIT_CRITICAL(&s_dpp_session_lock);
    return ready;
}

void esp32_mquickjs_wifi_dpp_session_wait_end(esp32_mquickjs_wifi_dpp_session_t *s, bool close)
{
    portENTER_CRITICAL(&s_dpp_session_lock);
    uint32_t *count = close ? &s->close_waiters : &s->receive_waiters;
    if (*count) --*count;
    portEXIT_CRITICAL(&s_dpp_session_lock);
}

bool esp32_mquickjs_wifi_dpp_session_observation(esp32_mquickjs_wifi_dpp_session_t *s,
    esp32_mquickjs_wifi_dpp_session_status_t *status)
{
    portENTER_CRITICAL(&s_dpp_session_lock);
    *status = s->status;
    bool result = status->error || status->closing || status->uri_ready || status->configs_ready || status->configs_consumed;
    bool ready = !(s->receive_waiters && result) && !(s->close_waiters && status->retired);
    portEXIT_CRITICAL(&s_dpp_session_lock);
    return ready;
}

static bool dpp_session_closing(esp32_mquickjs_wifi_dpp_session_t *s)
{
    portENTER_CRITICAL(&s_dpp_session_lock); bool closing = s->status.closing; portEXIT_CRITICAL(&s_dpp_session_lock);
    return closing;
}

static void dpp_session_fail(esp32_mquickjs_wifi_dpp_session_t *s, esp_err_t error, const char *stage)
{
    portENTER_CRITICAL(&s_dpp_session_lock);
    if (!s->status.closing && s->status.error == ESP_OK) { s->status.error = error; s->status.stage = stage; }
    dpp_session_close_locked(s, false);
    portEXIT_CRITICAL(&s_dpp_session_lock);
}

