99percentpeople/esp32qjs/components/esp32_mquickjs/src/modules/wifi_dpp/esp32_mquickjs_wifi_dpp_session.c
static void dpp_session_worker(void *opaque)
{
    esp32_mquickjs_wifi_dpp_session_t *s = opaque;
    portENTER_CRITICAL(&s_dpp_session_lock);
    bool first = !s->worker_started && !s->status.closing;
    s->worker_started = true;
    esp32_mquickjs_wifi_radio_operation_t token = s->operation;
    esp32_mquickjs_wifi_dpp_radio_status_t native = s->status.native;
    bool capture = s->status.capture_finished, native_closed = s->status.native_closed;
    bool helper_drained = s->status.helper_drained, listening = s->status.listening;
    bool uri = s->status.uri_ready || s->status.uri_consumed;
    bool configs = s->status.configs_ready || s->status.configs_consumed;
    bool connect = s->status.connection_requested, prepared = s->status.connection_prepared;
    bool established = s->status.connection_established, verified = s->status.connection_verified;
    uint32_t connection_generation = s->connection_generation;
    bool recover = s->restore_recovery_requested;
    s->restore_recovery_requested = false;
    portEXIT_CRITICAL(&s_dpp_session_lock);
    esp_err_t error = ESP_OK;
    const char *stage = NULL;
    if (first) {
        error = esp32_mquickjs_wifi_radio_dpp_begin(s->owners, s->allow_ap_channel_change, &s->options, &token, &native);
        esp32_mquickjs_wireless_secure_zero(&s->options, sizeof(s->options));
        if (error != ESP_OK) dpp_session_fail(s, error, native.stage);
    }
    if (token.identity && !dpp_session_closing(s)) {
        error = esp32_mquickjs_wifi_radio_dpp_status(&token, &native);
        if (error == ESP_OK) error = native.error;
        if (error != ESP_OK) dpp_session_fail(s, error, native.stage ? native.stage : "dpp-native-status");
        if (error == ESP_OK && !dpp_session_closing(s) && native.worker.native.uri_available && !uri) {
            stage = "dpp-uri-transfer";
            error = esp32_mquickjs_wifi_radio_dpp_uri(&token, s->uri, sizeof(s->uri), false);
            if (error == ESP_OK) error = esp32_mquickjs_wifi_radio_dpp_uri(&token, NULL, 0, true);
            if (error == ESP_OK) {
                portENTER_CRITICAL(&s_dpp_session_lock);
                s->status.uri_length = native.worker.native.uri_length; s->status.uri_ready = true;
                portEXIT_CRITICAL(&s_dpp_session_lock);
            }
        }
        if (error == ESP_OK && !dpp_session_closing(s) && !connect && !listening && !native.worker.native.terminal) {
            stage = "dpp-native-listen";
            error = esp32_mquickjs_wifi_radio_dpp_listen(&token, &native);
            if (error == ESP_OK) listening = true;
        }
        if (error == ESP_OK && !dpp_session_closing(s) && native.worker.native.terminal && !capture) {
            stage = "dpp-capture-retire";
            error = esp32_mquickjs_wifi_radio_dpp_finish_capture(&token, &native);
            if (error == ESP_OK) { capture = true; helper_drained = false; listening = false; }
        }
        if (error == ESP_OK && !dpp_session_closing(s) && capture && helper_drained && !configs) {
            stage = "dpp-config-transfer";
            unsigned count = native.worker.native.config_count;
            if (!count || count > ESP_DPP_MAX_CONFIG_COUNT) error = ESP_ERR_INVALID_SIZE;
            for (unsigned i = 0; error == ESP_OK && i < count; ++i)
                error = esp32_mquickjs_wifi_radio_dpp_config(&token, i, &s->configs[i]);
            if (error == ESP_OK) error = esp32_mquickjs_wifi_radio_dpp_configs_commit(&token);
            if (error == ESP_OK) {
                portENTER_CRITICAL(&s_dpp_session_lock);
                s->status.config_count = count; s->status.configs_ready = true; s->deadline_us = 0;
                portEXIT_CRITICAL(&s_dpp_session_lock);
            }
        }
        if (error == ESP_OK && !dpp_session_closing(s) && connect && !prepared) {
            stage = "dpp-configuration-select";
            esp32_mquickjs_wifi_dpp_auth_t selected;
            error = esp32_mquickjs_wifi_radio_dpp_select(&token, &s->configs[s->status.configuration_index],
                s->status.authentication, s->allow_ap_restart, &selected, &s->connection_config, &native);
            if (error == ESP_OK) prepared = true;
            else dpp_session_fail(s, error, native.stage ? native.stage : stage);
        }
        if (error == ESP_OK && !dpp_session_closing(s) && established && !verified) {
            stage = "dpp-negotiated-authentication";
            error = esp32_mquickjs_wifi_radio_dpp_check_connection(&token, s->status.authentication, s->connection_link.bssid);
            if (error == ESP_OK) verified = true;
        }
        if (error != ESP_OK && error != ESP_ERR_NOT_FINISHED && error != ESP_ERR_TIMEOUT)
            dpp_session_fail(s, error, native.stage ? native.stage : stage);
    }
    if (token.identity && dpp_session_closing(s) && !connection_generation) {
        if (recover) {
            stage = "dpp-restore-recovery";
            error = esp32_mquickjs_wifi_radio_dpp_recover(&token, &native);
        }
        if (!native_closed && (!recover || error == ESP_OK)) {
            stage = "dpp-native-close";
            error = esp32_mquickjs_wifi_radio_dpp_prepare_close(&token, &native);
            if (error == ESP_OK) { native_closed = true; helper_drained = false; }
        } else if (native_closed && helper_drained) {
            stage = "dpp-radio-release";
            error = esp32_mquickjs_wifi_radio_dpp_close(&token, &native);
        }
    }
    int64_t now = esp_timer_get_time();
    portENTER_CRITICAL(&s_dpp_session_lock);
    s->operation = token; s->status.native = native; s->status.listening = listening;
    s->status.recovery_pending = s->restore_recovery_requested || native.restore_recovery_pending;
    s->status.capture_finished = capture; s->status.native_closed = native_closed;
    s->status.helper_drained = helper_drained;
    s->status.connection_prepared = prepared; s->status.connection_verified = verified;
    s->status.reserved_bytes = sizeof(*s) + (token.identity ? native.reserved_bytes : 0);
    s->status.cleanup_error = error;
    s->status.cleanup_stage = error == ESP_OK ? NULL : native.stage ? native.stage : stage;
    if (s->status.closing) dpp_session_scrub(s);
    s->status.worker_busy = false;
    s->next_retry_us = now <= INT64_MAX - 100000 ? now + 100000 : INT64_MAX;
    portEXIT_CRITICAL(&s_dpp_session_lock);
    esp32_mquickjs_wifi_dpp_session_release(s); /* Worker. */
    portENTER_CRITICAL(&s_dpp_session_lock); --s_dpp_workers; portEXIT_CRITICAL(&s_dpp_session_lock);
}

