99percentpeople/esp32qjs/components/esp32_mquickjs/src/modules/wifi_dpp/esp32_mquickjs_wifi_dpp_session.c
#include "esp32_mquickjs_wifi_dpp_session_connection.inc"

/* Runtime-only helper phase, serialized with worker by worker_busy. A public
 * result cannot be published while DHCP/IP cleanup is pending. Final helper
 * release follows final Radio release, keeping admission continuously closed. */
static bool dpp_session_progress_helper(int64_t now)
{
    portENTER_CRITICAL(&s_dpp_session_lock);
    esp32_mquickjs_wifi_dpp_session_t *s = s_dpp_active;
    bool release = s && s->status.closing && !s->operation.identity;
    bool run = s && !s->status.worker_busy && now >= s->next_retry_us &&
        s->references != UINT32_MAX && (release ||
        ((s->status.closing ? s->status.native_closed : s->status.capture_finished) && !s->status.helper_drained));
    if (run) { ++s->references; s->status.worker_busy = true; }
    portEXIT_CRITICAL(&s_dpp_session_lock);
    if (!run) return false;
    esp_err_t error = release ? esp32_mquickjs_wifi_dpp_station_release(&s->station_identity) :
        esp32_mquickjs_wifi_dpp_station_drain(s->station_identity);
    portENTER_CRITICAL(&s_dpp_session_lock);
    s->status.cleanup_error = error;
    s->status.cleanup_stage = error == ESP_OK ? NULL : "dpp-station-drain";
    bool detach = error == ESP_OK && release;
    if (error == ESP_OK) {
        s->status.helper_drained = true;
        if (detach) { s->status.retired = true; s_dpp_active = NULL; }
    }
    s->status.worker_busy = false;
    s->next_retry_us = error == ESP_OK ? 0 : now <= INT64_MAX - 100000 ? now + 100000 : INT64_MAX;
    portEXIT_CRITICAL(&s_dpp_session_lock);
    if (detach) esp32_mquickjs_wifi_dpp_session_release(s); /* Registry. */
    esp32_mquickjs_wifi_dpp_session_release(s); /* Helper phase. */
    return true;
}

bool esp32_mquickjs_wifi_dpp_service(void)
{
    int64_t now = esp_timer_get_time();
    portENTER_CRITICAL(&s_dpp_session_lock);
    esp32_mquickjs_wifi_dpp_session_t *s = s_dpp_active;
    if (s && !s->status.closing && s->deadline_us && now >= s->deadline_us) dpp_session_close_locked(s, true);
    portEXIT_CRITICAL(&s_dpp_session_lock);
    bool connection_progress = dpp_session_progress_connection(now);
    bool helper_progress = dpp_session_progress_helper(now) || connection_progress;
    portENTER_CRITICAL(&s_dpp_session_lock);
    s = s_dpp_active;
    bool helper_pending = s && (s->status.closing ? s->status.native_closed : s->status.capture_finished) && !s->status.helper_drained;
    bool work = s && !helper_pending && (s->status.closing ? s->operation.identity != 0 && !s->connection_generation :
        ((!s->status.configs_ready && !s->status.configs_consumed) || s->status.connection_requested));
    /* A failed SDK START needs explicit recovery. Repeated close/runtime
     * cleanup must not schedule an unchanging native fault every 100 ms. */
    bool recovery_wait = s && s->status.closing && s->status.native.restore_start_failed && !s->status.recovery_pending;
    bool run = work && !recovery_wait && !s->status.worker_busy && s->references != UINT32_MAX && now >= s->next_retry_us;
    if (run) { ++s->references; ++s_dpp_workers; s->status.worker_busy = true; }
    portEXIT_CRITICAL(&s_dpp_session_lock);
    if (!run) return helper_progress;
    if (esp32_mquickjs_submit_background_worker(dpp_session_worker, s)) return true;
    portENTER_CRITICAL(&s_dpp_session_lock);
    s->status.worker_busy = false;
    s->status.cleanup_error = ESP_ERR_NO_MEM; s->status.cleanup_stage = "dpp-worker-queue";
    s->next_retry_us = now <= INT64_MAX - 100000 ? now + 100000 : INT64_MAX;
    portEXIT_CRITICAL(&s_dpp_session_lock);
    esp32_mquickjs_wifi_dpp_session_release(s);
    portENTER_CRITICAL(&s_dpp_session_lock); --s_dpp_workers; portEXIT_CRITICAL(&s_dpp_session_lock);
    return false;
}

bool esp32_mquickjs_wifi_dpp_prepare_runtime_destroy(void)
{
    portENTER_CRITICAL(&s_dpp_session_lock);
    s_dpp_runtime_closing = true;
    if (s_dpp_active) dpp_session_close_locked(s_dpp_active, false);
    portEXIT_CRITICAL(&s_dpp_session_lock);
    (void)esp32_mquickjs_wifi_dpp_service();
    portENTER_CRITICAL(&s_dpp_session_lock);
    bool drained = !s_dpp_active && !s_dpp_workers;
    portEXIT_CRITICAL(&s_dpp_session_lock);
    return drained;
}
#endif
